- In pandas we can join two dataframes

    - merge

    - join 

    - concat

**Merge**
- it is under the function :pd.merge

- it is similar to SQL joins 

- you can join with specific columns

In [5]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt 
import seaborn as sns

In [3]:
import pandas as pd 
d1={'ID':[1,2,3],
   'Name':['Chandu','Pawan','Ajay'],
   }
df2={'ID':[1,2,4],
   'Age':[20,25,30]}
df1=pd.DataFrame(d1)
df2=pd.DataFrame(df2)

In [20]:
df1

   ID    Name
0   1  Chandu
1   2   Pawan
2   3    Ajay

In [23]:
df2

   ID  Age
0   1   20
1   2   25
2   4   30

In [25]:
pd.merge(df1,df2,on='ID',how='inner')

   ID    Name  Age
0   1  Chandu   20
1   2   Pawan   25

In [27]:
pd.merge(df1,df2,on='ID',how='outer')

   ID    Name   Age
0   1  Chandu  20.0
1   2   Pawan  25.0
2   3    Ajay   NaN
3   4     NaN  30.0

In [29]:
pd.merge(df1,df2,on='ID',how='left')

   ID    Name   Age
0   1  Chandu  20.0
1   2   Pawan  25.0
2   3    Ajay   NaN

In [7]:
pd.merge(df1,df2,on='ID',how='right')

   ID    Name  Age
0   1  Chandu   20
1   2   Pawan   25
2   4     NaN   30

In [11]:
pd.concat([df1,df2],axis=1)

   ID    Name  ID  Age
0   1  Chandu   1   20
1   2   Pawan   2   25
2   3    Ajay   4   30